// - Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
//  let a = +prompt("Введіть перше число");
// let b = +prompt('Введіть друге число');
//  if( a > b ){
//      console.log(`${a} Більше число`);
//  }
//  else if(b > a){
//           console.log(`${b} Більше число`);
//  }
//  else console.log(`Числа однакові`);

//  - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let room = +prompt(`Введіть номер квартири`);
// if (room >= 1 && room <=20){
//     document.write("знаходиться в першому під'їзді");
// }
// else if( room >= 21 && room<=48){
//         document.write("знаходиться в другому під'їзді");
// }
// else if (room >=49 && room<=90){
//         document.write("знаходиться в третьому під'їзді");
// }
// else{
//         document.write("такої квартірі в нашому будинку немає");
// }


// - Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = 9;
//
// if (number == 10){
//     document.write('ВІРНО');
// }
// else {
//     document.write('НЕВІРНО');
// }


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// якщо в змінну записали щось інше, спрацьовує else
// let x = undefined;
// if(typeof x === 'number') {
//     console.log(1);
// }
// else if( typeof x === 'string') {
//     console.log(2);
// }
// else if(typeof x === 'boolean') {
//     console.log(3);
// }
// else if (typeof x === 'object') {
//     console.log(4);
// }
// else{
//     console.log('щось інше');
// }


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let temp = +prompt('характеризує температуру');
// if(temp >= 10 && temp<= 22){
//     alert('ми йдемо ВЧИТИСЯ')
// }
// else {
//     alert('вчимося ОНЛАЙН')
// }

//
//  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let viktorina = 6;
//
// switch (viktorina){
//     case 1:
//         console.log('АВТОМОБИЛЬ!');
//     break;
//     case 2:
//         console.log('MOTIK');
//         break;
//     case 3:
//         console.log('IPHONE');
//         break;
//     case 4:
//         console.log('MP3 PLAYER');
//         break;
//     case 5:
//         console.log('FONARIK');
//         break;
//     default:
//         console.log('число не вірне ...')
// }